# Terminal/Shell
brew 'zoxide'
brew 'fzf'
brew 'lazygit'
brew 'awscli'
brew 'angular-cli'
cask 'warp'
cask 'termius'
cask 'biscuit'

# IDEs
cask 'jetbrains-toolbox'
cask 'visual-studio-code'

# Browsers
cask 'google-chrome'
cask 'brave-browser'
cask 'firefox'

# Dev Tools
brew 'volta'
brew 'nvm'
cask 'figma'
brew 'gradle'
brew 'maven'
brew 'docker'
cask 'aws-vpn-client'
cask 'gas-mask'
cask 'dbeaver-community'
cask 'postman'

# Productivity
cask 'rectangle'
cask 'the-unarchiver'
cask 'maccy'
cask 'shottr'
cask 'raycast'
cask 'bitwarden'
cask 'appcleaner'
cask 'google-drive'
cask 'spotify'

# Communication 
cask 'zoom'
cask 'slack'
