tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'

brew 'awscli'
brew 'docker'
brew 'volta'
brew 'gulp-cli'
brew 'maven'
brew 'zoxide'
brew 'fzf'
brew 'angular-cli'
cask 'rectangle'
cask 'appcleaner'
cask 'bitwarden'
cask 'google-chrome'
cask 'brave-browser'
cask 'forticlient-vpn'
cask 'aws-vpn-client'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
cask 'warp'
cask 'termius'
cask 'gas-mask'
cask 'spotify'
cask 'google-drive'
cask 'biscuit'
cask 'the-unarchiver'
cask 'runjs'
cask 'maccy'
cask 'dbeaver-community'
cask 'shottr'
cask 'raycast'
cask 'postman'
