tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask'

# ============================================================================
# GUI
# ============================================================================

# This is used to don't turn off the screen when idle
# cask 'caffeine'

# This is used to move windows and resize it.
cask 'rectangle'

# To delete applications with some confidence
cask 'appcleaner'

# To edit screenshots
cask 'shottr'

# ============================================================================
# Password manager
# ============================================================================

cask 'bitwarden'

# ============================================================================
# Browsers
# ============================================================================

cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'

# ============================================================================
# Communication
# ============================================================================

cask 'slack'
cask 'discord'
# cask 'zoomus'
# cask 'microsoft-teams'
# cask 'skype'

# ============================================================================
# VPN
# ============================================================================

# cask 'forticlient-vpn'

# ============================================================================
# IDE
# ============================================================================

cask 'jetbrains-toolbox'
cask 'visual-studio-code'

# ============================================================================
# Terminal
# ============================================================================

# Replacement for Terminal on macOS
cask 'iterm2'
# cask 'warp'

# Version control of text stuff
brew 'git'

# Editor
# brew 'vim'
# brew 'nvim'

# Simple yet powerful editor https://github.com/zyedidia/micro
# brew 'micro'

# To fuzzy find in terminal
# brew 'fzf'
brew "z"

# Useful Http client
# brew 'httpie'

# Commands corrector
# brew 'thefuck'

# To use the commandline "tree" useful for write project structures
brew 'tree'

# To view json files
brew 'jq'

# To enable use of .envrc and makefiles properly without manual steps
# brew 'direnv'

# ============================================================================
# Web Development
# ============================================================================

# To edit your /etc/hosts files and compose it
# cask 'gas-mask'
# cask 'http-toolkit'

# ============================================================================
# Personal
# ============================================================================

# To listen to music
cask 'spotify'

cask 'google-drive'
cask 'biscuit'
cask 'the-unarchiver'
cask 'runjs'
brew 'nvm' # Node version manager